## Staging: database-tools
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 3 to add, 3 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.blazer_exection_role_parameter_policy_actions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "blazer_exection_role_parameter_policy_actions"  {
      ~ id      = "1319026527" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssmmessages:OpenDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:CreateControlChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/sqlalchemy_database_reader_uri",
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/BLAZER_DATABASE_URL",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              ~ (known after apply),
              ~ (known after apply),
                # (2 unchanged elements hidden)
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # data.aws_iam_policy_document.blazer_task_role_actions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "blazer_task_role_actions"  {
      ~ id      = "1319026527" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssmmessages:OpenDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:CreateControlChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/sqlalchemy_database_reader_uri",
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/BLAZER_DATABASE_URL",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              ~ (known after apply),
              ~ (known after apply),
                # (2 unchanged elements hidden)
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # aws_ecs_service.blazer will be updated in-place
  ~ resource "aws_ecs_service" "blazer" {
        id                                 = "arn:aws:ecs:ca-central-1:239043911459:service/blazer/blazer"
        name                               = "blazer"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:239043911459:task-definition/blazer:6" -> (known after apply)
        # (14 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.blazer must be replaced
-/+ resource "aws_ecs_task_definition" "blazer" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:239043911459:task-definition/blazer:6" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = []
                  - essential        = true
                  - image            = "239043911459.dkr.ecr.ca-central-1.amazonaws.com/database-tools/blazer:v2.6.5"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "blazer"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "blazer"
                        }
                    }
                  - mountPoints      = []
                  - name             = "blazer"
                  - portMappings     = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "BLAZER_DATABASE_URL"
                          - valueFrom = "arn:aws:ssm:ca-central-1:239043911459:parameter/sqlalchemy_database_reader_uri"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:ssm:ca-central-1:239043911459:parameter/BLAZER_DATABASE_URL"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "blazer" -> (known after apply)
      ~ revision                 = 6 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.blazer_exection_role_parameter_policy will be updated in-place
  ~ resource "aws_iam_policy" "blazer_exection_role_parameter_policy" {
        id        = "arn:aws:iam::239043911459:policy/blazer_exection_role_parameter_policy"
        name      = "blazer_exection_role_parameter_policy"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssmmessages:OpenDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:CreateControlChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/sqlalchemy_database_reader_uri",
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/BLAZER_DATABASE_URL",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.blazer_task_role_policy will be updated in-place
  ~ resource "aws_iam_policy" "blazer_task_role_policy" {
        id        = "arn:aws:iam::239043911459:policy/blazer_task_role_policy"
        name      = "blazer_task_role_policy"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssmmessages:OpenDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:CreateControlChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/sqlalchemy_database_reader_uri",
                          - "arn:aws:ssm:ca-central-1:239043911459:parameter/BLAZER_DATABASE_URL",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_ssm_parameter.notify_o11y_google_oauth_client_id will be created
  + resource "aws_ssm_parameter" "notify_o11y_google_oauth_client_id" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "notify_o11y_google_oauth_client_id"
      + tags      = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tier      = "Standard"
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # aws_ssm_parameter.notify_o11y_google_oauth_client_secret will be created
  + resource "aws_ssm_parameter" "notify_o11y_google_oauth_client_secret" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "notify_o11y_google_oauth_client_secret"
      + tags      = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tier      = "Standard"
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

Plan: 3 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>